<?php



function getImages($id) {
	global $db, $live_site;
	$query = 'SELECT a.file_url FROM #__virtuemart_medias a JOIN #__virtuemart_product_medias b ON b.virtuemart_media_id = a.virtuemart_media_id WHERE a.published = 1 AND b.virtuemart_product_id = '.$id.' ORDER BY b.ordering, b.id LIMIT 10';
	$db->setQuery($query);
	$rows = $db->loadObjectList();
	$media = '';
	if ($rows) {
		foreach ($rows as $row) {
			$media .= '<picture>'.$live_site.htmlspecialchars(str_replace(' ', '%20', $row->file_url)).'</picture>'."\n";
		}
	}	
	return $media;
}

function getCustomFields($product_id) {
	
	define( '_JEXEC', 1 );
	define('JPATH_BASE', $_SERVER['DOCUMENT_ROOT']);
	define('DS', DIRECTORY_SEPARATOR);
	$path = JPATH_BASE . DS . 'includes' . DS;
	require($path . 'defines.php');
	require($path . 'framework.php');
	$app = JFactory::getApplication('site');
	$app->initialise();
	 
	if (!class_exists( 'VmConfig' )) require(JPATH_ROOT.DS.'administrator'.DS.'components'.DS.'com_virtuemart'.DS.'helpers'.DS.'config.php');
	VmConfig::loadConfig();	
	 
	$productModel = VmModel::getModel('Product'); // модель товара
	$product = $productModel->getProduct($product_id);// объект конкретного товара
	$customfields = $product->customfields;
	$lang = JLanguage::getInstance('ru-RU');	

	foreach ($customfields as $cf) {
		if (($cf->virtuemart_custom_id != '22')  && ($cf->virtuemart_custom_id != '27') && ($cf->virtuemart_custom_id != '28')) {
			$result .= $lang->_($cf->custom_title) . ' ' .strip_tags(html_entity_decode($cf->customfield_value),'<p>,<br>,<strong>,<em>,<ul>,<ol>,<li>,<tr>') . '<br>' . "\n"; 
		}
		
	}

	return $result;
}


function getImagesAvito($id) {
	global $db, $live_site;
	$query = 'SELECT a.file_url FROM #__virtuemart_medias a JOIN #__virtuemart_product_medias b ON b.virtuemart_media_id = a.virtuemart_media_id WHERE a.published = 1 AND b.virtuemart_product_id = '.$id.' ORDER BY b.ordering, b.id LIMIT 10';
	$db->setQuery($query);
	$rows = $db->loadObjectList();
	$media = '';
	if ($rows) {
		foreach ($rows as $row) {
			$media .= '<Image url="'.$live_site.htmlspecialchars(str_replace(' ', '%20', $row->file_url)).'"/>'."\n";			
		}
	}	
	return $media;
}

function getAvitoCategory($id){
	$category .= ''."\n";
	$goodsType = '';
	$categoryList = array(
		 "1" => "Спорт и отдых",
		 "6" => "Спорт и отдых",
		 "7" => "Спорт и отдых",
		 "8" => "Спорт и отдых",
		 "9" => "Спорт и отдых",
		 "10" => "Посуда и товары для кухни",
		 "14" => "Охота и рыбалка",
		 "18" => "Охота и рыбалка",
		 "19" => "Для дома и дачи",
		 "66" => "Спорт и отдых",
		 "72" => "Спорт и отдых",
		 "73" => "Спорт и отдых",
		 "74" => "Охота и рыбалка",
		 "75" => "Посуда и товары для кухни",
		 "76" => "Для дома и дачи",
		 "85" => "Спорт и отдых",
		 "86" => "Товары для кухни",
		 "87" => "Для дома и дачи",
		 "88" => "Спорт и отдых",
		 "89" => "Спорт и отдых",
		 "90" => "Спорт и отдых",
		 "91" => "Охота и рыбалка",
		 "92" => "Охота и рыбалка",
		 "93" => "Охота и рыбалка",
		 "94" => "Охота и рыбалка",
		 "95" => "Охота и рыбалка",
		 "96" => "Охота и рыбалка",
		 "97" => "Охота и рыбалка",
		 "98" => "Охота и рыбалка",
		 "99" => "Охота и рыбалка",
		 "100" => "Охота и рыбалка",
		 "102" => "Охота и рыбалка",
		 "101" => "Охота и рыбалка",
		 "103" => "Охота и рыбалка",
		 "104" => "Охота и рыбалка",
		 "105" => "Охота и рыбалка",
		 "106" => "Для дома и дачи",
		 "108" => "Для дома и дачи",
		 "111" => "Охота и рыбалка",
		 "112" => "Для дома и дачи",
		 "114" => "Охота и рыбалка",
		 "116" => "Охота и рыбалка",
		 "125" => "Охота и рыбалка",
		 "127" => "Спорт и отдых",
		 "128" => "Охота и рыбалка",
		 "130" => "Охота и рыбалка",
		 "131" => "Посуда и товары для кухни",
		 "132" => "Посуда и товары для кухни",
		 "133" => "Посуда и товары для кухни",
		 "134" => "Посуда и товары для кухни",
		 "136" => "Спорт и отдых",
		 "144" => "Посуда и товары для кухни",
		 "146" => "Посуда и товары для кухни",
		 "147" => "Спорт и отдых",
		 "148" => "Спорт и отдых",
		 "150" => "Посуда и товары для кухни",
		 "156" => "Посуда и товары для кухни",
		 "157" => "Посуда и товары для кухни",
		 "158" => "Товары для кухни",
		 "161" => "Посуда и товары для кухни",
		 "166" => "Посуда и товары для кухни",
		 "167" => "Посуда и товары для кухни",
		 "172" => "Охота и рыбалка",
		 "175" => "Посуда и товары для кухни",
		 "176" => "Посуда и товары для кухни",
		 "177" => "Спорт и отдых",
		 "178" => "Спорт и отдых",
		 "179" => "Спорт и отдых",
		 "181" => "Спорт и отдых",
	);
	$category .= $categoryList[$id] ."\n";
	if ($categoryList[$id] == "Посуда и товары для кухни") {
		$goodsType = "Посуда";
	} elseif ($id == "106") {
		$goodsType = "Товары для кухни";
	} elseif ($id == "108") {
		$goodsType = "Мелкая кухонная техника";
	} elseif ($id == "111") {
		$goodsType = "";
	} elseif ($id == "19") {
		$goodsType = "Товары для кухни";
	} elseif ($categoryList[$id] == "Спорт и отдых") {
		$goodsType = "Другое";
	}

	return [$category, $goodsType];
}


function urlMarketEncode($url) {
	$url_arr = explode('/', $url);
	$url_st = '';
	foreach ($url_arr as $st) {
		$url_st .= '/'.urlencode($st);
	}
	return $url_st;
}

function getCategoryId(){
	return '1,6,7,8,9,10,14,18,19,66,72,73,74,75,76,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,108,111,112,114,116,125,127,128,130,131,132,133,134,136,144,146,147,148,150,156,157,158,161,166,167,172,175,176,177,178,179,181';
}

function getProductId(){	
	return '1313,1315,1316,1318,1320,1321,1322,1323,1328,1337,1349,1355,1357,1359,1360,1363,1365,1366,1367,1372,1373,1375,1376,1377,1379,1380,1381,1382,1385,1388,1393,1396,1397,1407,1410,1411,1419,1422,1427,1428,1442,1443,1445,1446,1447,1449,1461,1466,1474,1480,1481,1483,1485,1493,1519,1539,1540,1547,1554,1559,1562,1564,1569,1576,1577,1581,1585,1586,1598,1591,1597,1605,1609,1610,1611,1612,1613,1622,1624,1626,1627,1630,1631,1629,1632,1651,1652,1653,1654,1655,1656,1657,1659,1660,1662,1663,1665,1667,1671,1673,1683,1691,1695,1696,1704,1708,1718,1720,1726,1727,1729,1733,1739,1742,1743,1744,1750,1752,1753,1757,1758,1773,1781,1782,1784,1785,1806,1810,1859,1863,1865,1868,1870,1872,1882,1884,1885,1887,1892,1894,1898,2042,2043,2076,2078,2085,2094,2096,2098,2111,2122,2123,2126,2141,2142,2143,2145,2146,2149,2154,2155,2161,2168,2169,2171,2178,2411,2470,2471,2472,2477,2487,2490,2493,2495,2501,2502,2510,2520,2522,2523,2526,2528,2552,2593,2594,2595,2596,2609,2614,2615,2618,2619,2620,2622,2624,2650,2654,2708,2715,2728,2735,2740,2741,2764,2765,2767,2770,2788,2789,2790,2796,2801,2802,2803,2804,2806,2807,2808,2809,2810,2817,2818,2820,2822,2824,2838,2839,2841,2849,2851,2853,2854,2855,2856,2857,2859,2866,2868,2870,2872,2873,2889,2890,2893,2907,2908,2909,2911,2912,2920,2937,2942,2945,2946,2947,2978,2979,2980,3012,3013,3033,3034,3038,3039,3040,3043,3045,3050,3099,3103,3117,3134,3136,3151,3163,3200,3201,3202,3203,3205,3206,3262,3263,3264,3272,3274,3283,3284,3285,3290,3293,3294,3301,3303,3308,3309,3310,3311,3312,3313,3322,3327,3336,3344,3351,3366,3367,3368,3391,3396,3397,3434,3464,3471,3472,3490,3496,3497,3498,3503,3505,3507,3509,3510,3511,3512,3513,3514,3515,3516,3517,3518,3519,3521,3523,3527,3533,3534,3541,3543,3544,3555,3556,3558,3563,3565,3590,3594,3595,3600,3603,3604,3605,3612,3616,3655,3660,3663,3665,3664,3666,3667,3683,3730,3738,3739,3740,3745,3758,3761,3767,3788,3792,3797,3830,3832,3852,3855,3866,3879,3893,3894,3895,3901,3902,3903,3904,3905,3914,3915,3916,3918,3919,3922,3923,3924,3925,3926,3927,3928,3929,3931,4079,4084,4093,4097,4104,4105,4107,4108,4109,4110,4112,4114,4150,4151,4152,4154,4155,4158,4159,4162,4163,4166,4175,4191,4201,4202,4203,4204,4205,4206,4208,4211,4212,4219,4220,4225,4236,4237,4238,4250,4252,4253,4254,4256,4257,4259,4260,4261,4265,4271,4272,4274,4275,4276,4278,4295,4297,4303,4304,4219,4323,4324,4326,4327,4328,4330,4332,4335,4340,4342,4344,4345,4346,4347,4348,4349,4352,4354,4356,4357,4361,4362,4363,4365,4368,4370,4374,4375,4376,4377,4380,4381,4389,4390,4391,4393,4394,4395,4416,4421,4422,4443,4458,4462,4463,4465,4466,4468';
} 

?>